'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12. 
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). 
Напишите решения через list и через dict.
'''
try:
	m = int(input('Введите номер месяца (1-12):'))
	if not 1 <= m <= 12:
		print("Вы ввели некорректные данные.")
		exit()	
except Exception as e:
	print("Вы ввели некорректные данные.")
	exit()

print("Способ первый через списки")

winter = [1, 2, 12]
spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]

if m in winter:
	print("Зима")
elif m in spring:
	print("Весна")
elif m in summer:
	print("Лето")
elif m in autumn:
	print("Осень")

print("Способ второй через словарь")
data = {1: "Зима",
		2: "Зима",
		3: "Весна",
		4: "Весна",
		5: "Весна",
		6: "Лето",
		7: "Лето",
		8: "Лето",
		9: "Осень",
		10: "Осень",
		11: "Осень", 
		12: "Зима"
		}
print(data[m])
